# Задача №17. Общее обсуждение
#             Дан список чисел. Определите, сколько в нем
#             встречается различных чисел.

# list = [1, 1, 2, 0, -1, 3, 4, 4]
# list = set(list)
# print(len(list))

list = []



