# Задание №1
#       Создайте несколько переменных разных типов.
#       Проверьте к какому типу относятся созданные переменные. 

a = 32
b = "Hello"
c = 12.3
d = True
e = [1, 2, 3]
f = (1, 2, 3)

print(a, type(a))
print(b, type(b))
print(c, type(c))
print(d, type(d))
print(f, type(f))
